# FoCS Project 2019/ - Matteo Licciardello mat. 799368

### Import libraries and data

In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', 500)

### PATH NECESSARIO
path = ''

In [2]:
loans_lenders = pd.read_csv(path + 'loans_lenders.csv')

In [3]:
loans_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

### 1) Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender

In [4]:
#Conversione lenders in lista di elementi

tmp = loans_lenders.lenders.str.split(", ")
loans_lenders['lenders'] = tmp
loans_lenders

         loan_id                                            lenders
0         483693  [muc888, sam4326, camaran3922, lachheb1865, re...
1         483738  [muc888, nora3555, williammanashi, barbara5610...
2         485000  [muc888, terrystl, richardandsusan8352, sherri...
3         486087  [muc888, james5068, rudi5955, daniel9859, don9...
4         534428  [muc888, niki3008, teresa9174, mike4896, david...
...          ...                                                ...
1387427   678999  [michael43411218, carol5987, gooddogg1, chris4...
1387428  1207353  [rjhoward1986, jeffrey6870, trolltech4460, ely...
1387429  1206220  [vicky7746, gooddogg1, fairspirit, craig972996...
1387430  1206425  [rich6705, sergiiy9766, angela7509, barbara561...
1387431  1206486                            [alan5175, amy38101311]

[1387432 rows x 2 columns]

In [5]:
## Creazione Dataframe con ogni riga corrispondente ad un lender

loans_lenders = loans_lenders.explode('lenders')
pd.DataFrame(loans_lenders)
loans_lenders

         loan_id            lenders
0         483693             muc888
0         483693            sam4326
0         483693        camaran3922
0         483693        lachheb1865
0         483693        rebecca3499
...          ...                ...
1387430  1206425  trogdorfamily7622
1387430  1206425          danny6470
1387430  1206425            don6118
1387431  1206486           alan5175
1387431  1206486        amy38101311

[28293931 rows x 2 columns]

In [6]:
## Dump dataframe
#loans_lenders.to_csv(path + 'loans_lenders_1.csv', index=False)

## Read dataframe
#loans_lenders = pd.read_csv(path + 'loans_lenders_1.csv')
loans_lenders

         loan_id            lenders
0         483693             muc888
0         483693            sam4326
0         483693        camaran3922
0         483693        lachheb1865
0         483693        rebecca3499
...          ...                ...
1387430  1206425  trogdorfamily7622
1387430  1206425          danny6470
1387430  1206425            don6118
1387431  1206486           alan5175
1387431  1206486        amy38101311

[28293931 rows x 2 columns]

### 2) For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing

In [7]:
loans = pd.read_csv(path + 'loans.csv')
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner

In [8]:
loans.planned_expiration_time

0          2014-02-14 03:30:06.000 +0000
1          2014-03-26 22:25:07.000 +0000
2          2014-02-15 21:10:05.000 +0000
3          2014-02-21 03:10:02.000 +0000
4          2014-02-13 06:10:02.000 +0000
                       ...
1419602    2016-01-02 01:00:03.000 +0000
1419603    2016-01-02 16:40:07.000 +0000
1419604    2016-01-03 22:20:04.000 +0000
1419605    2016-01-05 08:50:02.000 +0000
1419606    2016-01-03 20:50:06.000 +0000
Name: planned_expiration_time, Length: 1419607, dtype: object

In [9]:
loans.disburse_time

0          2013-12-22 08:00:00.000 +0000
1          2013-12-20 08:00:00.000 +0000
2          2014-01-09 08:00:00.000 +0000
3          2014-01-17 08:00:00.000 +0000
4          2013-12-17 08:00:00.000 +0000
                       ...
1419602    2015-11-23 08:00:00.000 +0000
1419603    2015-11-24 08:00:00.000 +0000
1419604    2015-11-13 08:00:00.000 +0000
1419605    2015-11-03 08:00:00.000 +0000
1419606    2015-11-03 08:00:00.000 +0000
Name: disburse_time, Length: 1419607, dtype: object

In [10]:
## Si valuta la presenza di valori nulli nelle due colonne di valori

print(loans.planned_expiration_time.isna().sum(), loans.disburse_time.isna().sum())

371834 2813

In [11]:
print(type(loans.planned_expiration_time), type(loans.disburse_time))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [12]:
## I valori vengono forniti in formato stringa
## Necessario convertire in date-time per poter effettuare l'operazione di differenza temporale richiesta
## L'operazione non viene effettuata per i valori nulli

loans['planned_expiration_time'] = pd.to_datetime(loans['planned_expiration_time'])
loans['disburse_time'] = pd.to_datetime(loans['disburse_time'])

In [13]:
## Creazione dell'attributo "duration" che indica la durata del prestito

loans['duration'] = loans['planned_expiration_time'] - loans['disburse_time']

In [14]:
## Il numero di valori nulli ottenuto è dato dalla somma dei valori nulli dei due attributi
## In questo caso non corrisponde perfettamente perché due record hanno entrambi valori nulli
## A questi viene lasciato il valore nullo già assegnato

print(loans.duration.isna().sum())

374645

In [15]:
loans["duration"] = loans.apply(lambda x: x["duration"].days, axis = 1)
loans["duration"]

0          53.0
1          96.0
2          37.0
3          34.0
4          57.0
           ...
1419602    39.0
1419603    39.0
1419604    51.0
1419605    63.0
1419606    61.0
Name: duration, Length: 1419607, dtype: float64

In [16]:
## Il nuovo attributo si trova nell'ultima colonna del dataframe

loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06+00:00,2013-12-22 08:00:00+00:00,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner,53.0
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07+00:00,2013-12-20 08:00:00+00:00,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner,96.0
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05+00:00,2014-01-09 08:00:00+00:00,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,37.0
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02+00:00,2014-01-17 08:00:00+00:00,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner,34.0
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02+00:00,2013-12-17 08:00:00+00:00,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,57.0

In [17]:
## Dump dataframe
#loans.to_csv(path + 'loans_1.csv', index=False)
## Read dataframe
#loans = pd.read_csv(path + 'loans_1.csv')
loans

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06+00:00,2013-12-22 08:00:00+00:00,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner,53.0
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07+00:00,2013-12-20 08:00:00+00:00,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner,96.0
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05+00:00,2014-01-09 08:00:00+00:00,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,37.0
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02+00:00,2014-01-17 08:00:00+00:00,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner,34.0
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02+00:00,2013-12-17 08:00:00+00:00,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,57.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1419602,988180,NaN,NaN,NaN,NaN,400.0,400.0,funded,Tailoring,Services,NaN,KE,Kenya,NaN,shared,0.1,KES,138.0,2015-12-01 04:49:50.000 +0000,2016-01-02 01:00:03+00:00,2015-11-23 08:00:00+00:00,2015-12-28 15:44:18.000 +0000,14.0,16,4,2,"#Parent, #Repeat Borrower, #Woman Owned Biz",NaN,NaN,monthly,field_partner,39.0
1419603,988213,Perlita,English,"Perlita is 52 years old, married and has three...","Perlita is 52 years old, married and has three...",300.0,300.0,funded,Pigs,Agriculture,to buy feeds and other supplies to raise her pigs,PH,Philippines,"Numancia, Aklan",shared,0.1,PHP,145.0,2015-12-01 05:13:30.000 +0000,2016-01-02 16:40:07+00:00,2015-11-24 08:00:00+00:00,2015-12-22 10:37:06.000 +0000,14.0,12,1,1,"#Animals, #Elderly, #Repeat Borrower, #Woman O...",female,true,irregular,field_partner,39.0
1419604,989109,Okyeso Nyame Group,English,Okyeso Nyame group will begin its third cycle ...,Okyeso Nyame group will begin its third cycle ...,2425.0,2425.0,funded,Bakery,Food,"to buy margarine, flour and sugar at wholesale...",GH,Ghana,Chorkor,shared,0.1,GHS,231.0,2015-12-02 10:56:28.000 +0000,2016-01-03 22:20:04+00:00,2015-11-13 08:00:00+00:00,2015-12-26 20:24:47.000 +0000,8.0,76,2,1,"user_favorite, #Parent, #Vegan, #Woman Owned B...","female, female, female, male, male, female","true, true, true, true, true, true",irregular,field_partner,51.0
1419605,989143,Exequila,English,"Exequila is from San Miguel, Bohol. She is in...","Exequila is from San Miguel, Bohol. She is in...",100.0,100.0,funded,Farming,Agriculture,to buy feed and piglets,PH,Philippines,"San Miguel, Bohol",shared,0.1,PHP,125.0,2015-12-02 11:41:46.000 +0000,2016-01-05 08:50:02+00:00,2015-11-03 08:00:00+00:00,2015-12-06 21:03:57.000 +0000,12.0,3,1,1,NaN,female,true,irregular,field_partner,63.0
1419606,989240,Lydia,French,Lydia a 37ans et habite dans une zone rurale. ...,Lydia is 37 years old and lives in a rural are...,175.0,175.0,funded,Sewing,Services,"to buy a sewing machine, a sewing machine moto...",MG,Madagascar,Antananarivo,shared,0.1,MGA,443.0,2015-12-02 13:55:07.000 +0000,2016-01-03 20:50:06+00:00,2015-11-03 08:00:00+00:00,2015-12-04 23:17:04.000 +0000,14.0,7,1,1,NaN,female,true,monthly,field_partner,61.0

### 3) Find the lenders that have funded at least twice

In [18]:
## Conto il numero di volte che un lenders ha finanziato selezionando solo quelli che hanno partecipato a più di un finanziamento
## Sono presenti circa 9000 duplicati, quindi persone che partecipano allo stesso finanziamento in più fasi
## Queste vengono considerate così come sono

twice = loans_lenders.groupby(by='lenders', axis=0).count()
twice = twice[twice.loan_id >= 2]
twice

## Un metodo alternativo altrettanto valido è l'utilizzo della funziona value_counts() di Pandas
#twice = loans_lenders.lenders.value_counts(sort=False)
#twice = twice[twice.values >= 2]

                loan_id
lenders
000                  40
00000                39
0002                 70
0101craign0101       71
0132575               4
...                 ...
zzinnia              28
zzivnk7094            4
zzmcfate           1730
zzrvmf8538           15
zzzsai                4

[901811 rows x 1 columns]

In [19]:
## Dump del dataset con lenders che hanno finanziato almeno 2 volte
## Permette di visionare per intero i valori restituiti

#twice.to_csv(path + 'twice.csv', index=False)

### 4) For each country, compute how many loans have involved that country as borrowers.

In [20]:
## Per ciascun prestito venogno annotati una serie di valori che identificano il prestito, la nazionalità è uno di questi
## Si procede a contare quante volte ciascuno stato compare nel dataset loans.csv, dopo una verifica dei valori nulli

loans.country_name.isna().sum()

0

In [21]:
## Non si evidenziano valori nulli, si procede ad effettuare il conteggio

involved = loans.groupby(by='country_name', axis=0).loan_id.count()
involved

## Anche in questo caso era possibile procedere utilizzando la value_counts di Pandas nel seguente modo
# involved = loans['country_name'].value_counts()
# involved

country_name
Afghanistan        2337
Albania            3075
Armenia           13952
Azerbaijan        10172
Belize              218
                  ...
Vietnam           21839
Virgin Islands        2
Yemen              4206
Zambia             1277
Zimbabwe           5513
Name: loan_id, Length: 96, dtype: int64

In [22]:
## Dump del dataset che conta in quanti prestiti è coinvolta ciascuna nazione
## Permette di visionare per intero l'elenco dei paesi coinvolti

#involved.to_csv(path + 'involved.csv', index=False)

### 5) For each country, compute the overall amount of money borrowed.

In [23]:
## Anche in questo caso è necessario raggruppare per stato
## Successivamente si effettua la somma per mezzo della funzione sum() predefinita da Pandas

borrowed = loans.groupby(by='country_name', axis=0).loan_amount.sum()
borrowed

country_name
Afghanistan        1967950.0
Albania            4307350.0
Armenia           22950475.0
Azerbaijan        14784625.0
Belize              150175.0
                     ...
Vietnam           24681100.0
Virgin Islands       10000.0
Yemen              3444000.0
Zambia             1978975.0
Zimbabwe           5851875.0
Name: loan_amount, Length: 96, dtype: float64

In [24]:
## Dump dei dati che rappresentano il totale complessivo dei soldi prestati diviso per nazione
## Permette di visionare per intero l'elenco dei paesi coinvolti

#borrowed.to_csv(path + 'borrowed.csv', index=False)

### 6) Like the previous point, but expressed as a percentage of the overall amount lent.

In [25]:
## La richiesta è del tutto simile alla precedente, si potrebbero anche non istanziare nuove variabili
## L'operazione viene fatta ugualmente per uniformità, poi si moltiplicano per 100 i prestiti divisi per nazionalità
## Successivamente si divide tutto per il totale dei prestiti, ottenendo le percentuali per ogni stato

borrowed_perc = loans.groupby(by='country_name', axis=0).loan_amount.sum()
tot = loans.loan_amount.sum()

In [26]:
borrowed_perc = borrowed_perc*100/tot
borrowed_perc

country_name
Afghanistan       0.166573
Albania           0.364586
Armenia           1.942589
Azerbaijan        1.251410
Belize            0.012711
                    ...
Vietnam           2.089074
Virgin Islands    0.000846
Yemen             0.291509
Zambia            0.167506
Zimbabwe          0.495318
Name: loan_amount, Length: 96, dtype: float64

In [27]:
## Dump dei dati che rappresentano la percentuale complessiva dei soldi prestati divisa per nazione
## Permette di visionare per intero l'elenco dei paesi coinvolti

#borrowed_perc.to_csv('path + borrowed_perc.csv', index=False)

### 7) Like the three previous points, but split for each year (with respect to disburse time).

In [28]:
## In questo caso viene richiesto di splittare la percentuale anche per ogni anno, oltre che per nazionalità
## Doppio raggruppamento (nazione, anno) per la percentuale

loans.disburse_time = pd.to_datetime(loans.disburse_time)
borrowed_perc_y = loans.groupby(['country_name', loans.disburse_time.dt.year]).loan_amount.sum()
borrowed_perc_y

country_name  disburse_time
Afghanistan   2007.0            194975.0
              2008.0            365375.0
              2009.0            585125.0
              2010.0            563350.0
              2011.0            245125.0
                                 ...
Zimbabwe      2013.0            678525.0
              2014.0           1311575.0
              2015.0            723625.0
              2016.0            788600.0
              2017.0           1237600.0
Name: loan_amount, Length: 748, dtype: float64

In [29]:
## Raggruppamento singolo per anno per calcolare i vari totali

tot = loans.groupby(loans.disburse_time.dt.year).loan_amount.sum()
tot

disburse_time
2005.0       102850.0
2006.0      1376575.0
2007.0     15446525.0
2008.0     39423050.0
2009.0     59689475.0
2010.0     72609150.0
2011.0     93699300.0
2012.0    119977575.0
2013.0    132043925.0
2014.0    152270425.0
2015.0    155835650.0
2016.0    160978375.0
2017.0    166053650.0
2018.0       990025.0
Name: loan_amount, dtype: float64

In [30]:
## Calcolo finale della percentuale, divisa per nazionalità, per tutti gli anni a disposizione

borrowed_perc_y = borrowed_perc_y*100/tot
borrowed_perc_y

country_name  disburse_time
Afghanistan   2007.0           1.262258
              2008.0           0.926806
              2009.0           0.980282
              2010.0           0.775866
              2011.0           0.261608
                                 ...
Zimbabwe      2013.0           0.513863
              2014.0           0.861346
              2015.0           0.464351
              2016.0           0.489879
              2017.0           0.745301
Name: loan_amount, Length: 748, dtype: float64

In [31]:
## Dump dei dati che rappresentano la percentuale complessiva dei soldi prestati divisa per nazione e per anno
## Permette di visionare per intero l'elenco dei paesi coinvolti

#borrowed_perc_y.to_csv(path + 'borrowed_perc_y.csv', index=False)

### 8) For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

In [32]:
## Viene richiesto di calcolare il totale dei finanziamenti erogati da ciascun finanziatore
## Necessario unire le informazioni contenute nella tabella loans con quelle contneute nella tabella loans_lenders
## Per avere i riferimenti sul valore di ciascun finanziamento e contare il numero di finanziatore per ogni finanziamento
## Non sono presenti dati sufficienti per stabilire quanto ogni finanziatore ha contribuito ai singoli finanziamenti
## Di conseguenza, in caso di più finanzionatori per un singolo finanziamento, la quota di partecipazione
## viene divisa equamente tra i vari finanziatori, se un finanziatore partecipa in due fasi gli saranno assegnate due quote

In [33]:
## Si eliminano le informazioni non utili alla risposta della domanda per evitare processing di dati troppo onerosi

df_tmp = loans[['loan_id', 'loan_amount']]
df_tmp.head()

   loan_id  loan_amount
0   657307        125.0
1   657259        400.0
2   658010        400.0
3   659347        625.0
4   656933        425.0

In [34]:
## Ordinamento crescente per loan_id ed inserimento di una riga per partecipante

df_tmp = df_tmp.merge(loans_lenders, on='loan_id')
df_tmp.sort_values(by='loan_id', inplace=True)
df_tmp.drop('lenders', axis=1, inplace=True)
df_tmp.head()

          loan_id  loan_amount
6895573        84        500.0
6895572        84        500.0
6895571        84        500.0
16534000       85        500.0
16534001       85        500.0

In [35]:
## Calcolo numero finanziatori per ciascun finanziamento

df_app = df_tmp.loan_id.value_counts(sort=False)
df_app.sort_index(inplace=True)
df_tmp.drop_duplicates(subset='loan_id', inplace=True)
df_app.values

array([3, 2, 3, ..., 1, 1, 1], dtype=int64)

In [36]:
## Calcolo cifre versate per finanziamento per persona

df_tmp['loan_amount_per_person'] = df_tmp.loan_amount / df_app.values
df_tmp = df_tmp.merge(loans_lenders, on='loan_id')
df_tmp

          loan_id  loan_amount  loan_amount_per_person     lenders
0              84        500.0              166.666667        ward
1              84        500.0              166.666667     michael
2              84        500.0              166.666667      brooke
3              85        500.0              250.000000     michael
4              85        500.0              250.000000     patrick
...           ...          ...                     ...         ...
28293907  1444051        225.0              225.000000  lauren1424
28293908  1444053        725.0              725.000000   dario6858
28293909  1444058         25.0               25.000000      el5018
28293910  1444063         50.0               50.000000       pgs67
28293911  1444065         25.0               25.000000      el5018

[28293912 rows x 4 columns]

In [37]:
## Risultati finanziamenti versati per persona

money_per_lenders = df_tmp.groupby('lenders').loan_amount_per_person.sum()
money_per_lenders = pd.DataFrame(money_per_lenders)
money_per_lenders.reset_index(inplace=True)
money_per_lenders

                lenders  loan_amount_per_person
0                   000             1764.285078
1                 00000             1380.693644
2                  0002             2472.563566
3              00mike00               52.631579
4        0101craign0101             2623.565117
...                 ...                     ...
1383794        zzmcfate            66113.226325
1383795  zzpaghetti9994               51.020408
1383796      zzrvmf8538              576.978086
1383797          zzzsai              267.667370
1383798        zzzworld               27.522936

[1383799 rows x 2 columns]

In [38]:
## Dump del dataset con i soldi finanziati da ogni lenders
## Permette di visionare per intero i valori restituiti

#money_per_lenders.to_csv(path + 'money_per_lenders.csv', index=False)

### 9) For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [39]:
## Il problema parte dalla risoluzione dei valori missing per quanto riguarda la nazionalità dei lenders
## Questo viene risolto con una funzione di probabilità che assegna un valore al dato mancante secondo
## La frequenza con cui compaiono i paesi nei dati non mancanti
## Viene ricaricato anche il dataset relativo ai finanziamenti effettuati per persona perché tornerà utile

lenders = pd.read_csv(path + 'lenders.csv')
#money_per_lenders = pd.read_csv(path + 'money_per_lenders.csv')

In [40]:
lenders.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,NaN,NaN,0

In [41]:
weights = lenders.country_code.value_counts(normalize=True)
weights

US    0.664330
CA    0.076325
GB    0.043097
AU    0.041664
DE    0.017975
        ...
KM    0.000001
IO    0.000001
MS    0.000001
TF    0.000001
GW    0.000001
Name: country_code, Length: 234, dtype: float64

In [42]:
## Funzione di probabilità

lenders.loc[lenders.country_code.isna(), 'country_code'] = np.random.choice(weights.index,
                                                              p=weights.values,
                                                              size=lenders.country_code.isna().sum())
lenders

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,US,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,GR,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,US,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,DK,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,US,1461301154,NaN,NaN,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
2349169,janet7309,Janet,NaN,NaN,US,1342097163,NaN,NaN,NaN,NaN,0
2349170,pj4198,NaN,NaN,NaN,US,1342097515,NaN,NaN,NaN,NaN,0
2349171,maria2141,Maria,NaN,NaN,US,1342099723,NaN,NaN,2.0,NaN,0
2349172,simone9846,Simone,NaN,NaN,US,1342100213,NaN,NaN,NaN,NaN,0
2349173,laurie1160,Laurie,Timonium,Maryland,US,1342101767,NaN,NaN,1.0,Verian,0

In [43]:
## Ricontrollo proporzione, tutto ok

weights = lenders.country_code.value_counts(normalize=True)
weights

US    6.643339e-01
CA    7.613655e-02
GB    4.302619e-02
AU    4.141030e-02
DE    1.799739e-02
          ...
MS    1.702726e-06
TO    1.702726e-06
PN    1.702726e-06
IO    8.513631e-07
GW    8.513631e-07
Name: country_code, Length: 234, dtype: float64

In [44]:
## A partire dalla tabella money_per_lenders si associano le nazionalità attingendo dalla tabella lenders appena prodotta

money_per_lenders.rename(columns={'lenders': 'permanent_name'}, inplace=True)
money_per_lenders = money_per_lenders.merge(lenders[['permanent_name', 'country_code']], on='permanent_name')
money_per_lenders

         permanent_name  loan_amount_per_person country_code
0                   000             1764.285078           US
1                 00000             1380.693644           DE
2                  0002             2472.563566           US
3              00mike00               52.631579           TW
4        0101craign0101             2623.565117           US
...                 ...                     ...          ...
1383794        zzmcfate            66113.226325           US
1383795  zzpaghetti9994               51.020408           US
1383796      zzrvmf8538              576.978086           US
1383797          zzzsai              267.667370           US
1383798        zzzworld               27.522936           TC

[1383799 rows x 3 columns]

In [45]:
## Calcolo totale dei finanziamenti effettuati, diviso per nazione

money_lend_per_country = money_per_lenders.groupby(by='country_code').sum()
money_lend_per_country = pd.DataFrame(money_lend_per_country)
money_lend_per_country.rename(columns={'loan_amount_per_person': 'loan_lend'}, inplace=True)
money_lend_per_country

                 loan_lend
country_code
AD            1.266042e+04
AE            2.084820e+06
AF            1.615919e+05
AG            1.335349e+03
AI            4.016869e+02
...                    ...
YE            4.373333e+04
YT            1.979954e+02
ZA            9.026885e+05
ZM            5.131859e+04
ZW            1.685993e+04

[234 rows x 1 columns]

In [46]:
## Calcolo totale dei finanziamenti ottenuti, diviso per nazione

money_borrowed_per_country = loans.groupby(by='country_code').loan_amount.sum()
money_borrowed_per_country = pd.DataFrame(money_borrowed_per_country)
money_borrowed_per_country.rename(columns={'loan_amount': 'loan_borrowed'}, inplace=True)
money_borrowed_per_country

              loan_borrowed
country_code
AF                1967950.0
AL                4307350.0
AM               22950475.0
AZ               14784625.0
BA                 477250.0
...                     ...
XK                3083025.0
YE                3444000.0
ZA                1006525.0
ZM                1978975.0
ZW                5851875.0

[95 rows x 1 columns]

In [47]:
## Differenza finanziamenti effettuati - finanziamenti ottenuti

difference_lend_borrowed = money_lend_per_country.merge(money_borrowed_per_country, on='country_code', how='left')
difference_lend_borrowed.fillna(0, inplace=True)
difference_lend_borrowed['difference'] = difference_lend_borrowed.loan_lend - difference_lend_borrowed.loan_borrowed
difference_lend_borrowed.reset_index(inplace=True)
difference_lend_borrowed

    country_code     loan_lend  loan_borrowed    difference
0             AD  1.266042e+04            0.0  1.266042e+04
1             AE  2.084820e+06            0.0  2.084820e+06
2             AF  1.615919e+05      1967950.0 -1.806358e+06
3             AG  1.335349e+03            0.0  1.335349e+03
4             AI  4.016869e+02            0.0  4.016869e+02
..           ...           ...            ...           ...
229           YE  4.373333e+04      3444000.0 -3.400267e+06
230           YT  1.979954e+02            0.0  1.979954e+02
231           ZA  9.026885e+05      1006525.0 -1.038365e+05
232           ZM  5.131859e+04      1978975.0 -1.927656e+06
233           ZW  1.685993e+04      5851875.0 -5.835015e+06

[234 rows x 4 columns]

In [48]:
## Dump del dataset contenente il totale dei prestiti effettuati e ricevuti diviso per nazione e la loro differenza
## Permette di visionare per intero i valori restituiti

#difference_lend_borrowed.to_csv(path + 'difference_lend_borrowed.csv', index=False)

### 10) Which country has the highest ratio between the difference computed at the previous point and the population?

In [49]:
## Per rispondere a questa domanda è necessario unire il dataset appena creato al dataset country_stats.csv
## Contenente informazioni sulla popolazione di ciascuno stato

#difference_lend_borrowed = pd.read_csv(path + 'difference_lend_borrowed.csv')
country_stats = pd.read_csv(path + 'country_stats.csv')

In [50]:
difference_lend_borrowed

    country_code     loan_lend  loan_borrowed    difference
0             AD  1.266042e+04            0.0  1.266042e+04
1             AE  2.084820e+06            0.0  2.084820e+06
2             AF  1.615919e+05      1967950.0 -1.806358e+06
3             AG  1.335349e+03            0.0  1.335349e+03
4             AI  4.016869e+02            0.0  4.016869e+02
..           ...           ...            ...           ...
229           YE  4.373333e+04      3444000.0 -3.400267e+06
230           YT  1.979954e+02            0.0  1.979954e+02
231           ZA  9.026885e+05      1006525.0 -1.038365e+05
232           ZM  5.131859e+04      1978975.0 -1.927656e+06
233           ZW  1.685993e+04      5851875.0 -5.835015e+06

[234 rows x 4 columns]

In [51]:
country_stats.sort_values(by='country_code')

,country_name,country_code,country_code3,continent,region,population,population_below_poverty_line,hdi,life_expectancy,expected_years_of_schooling,mean_years_of_schooling,gni,kiva_country_name
87,United Arab Emirates,AE,ARE,Asia,Western Asia,9400145,19.5,0.839799,77.119,13.330000,9.500000,66203.299790,United Arab Emirates
28,Afghanistan,AF,AFG,Asia,Southern Asia,35530081,35.8,0.479375,60.704,10.053750,3.550000,1870.827131,Afghanistan
131,Albania,AL,ALB,Europe,Southern Europe,2930187,14.3,0.764174,77.968,14.179680,9.646810,10252.469830,Albania
109,Armenia,AM,ARM,Asia,Western Asia,2930450,32.0,0.742850,74.886,12.713218,11.291050,8189.115193,Armenia
29,Angola,AO,AGO,Africa,Middle Africa,29784193,40.5,0.533464,52.698,11.390000,4.979858,6290.895886,Angola
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19,Yemen,YE,YEM,Asia,Western Asia,28250420,54.0,0.482402,64.053,8.989500,3.000000,2300.272279,Yemen
41,South Africa,ZA,ZAF,Africa,Southern Africa,56717156,16.6,0.666429,57.658,12.995030,10.331880,12087.213640,South Africa
34,Zambia,ZM,ZMB,Africa,Eastern Africa,17094130,60.5,0.579070,60.819,12.512300,6.896000,3463.712718,Zambia
30,Zimbabwe,ZW,ZWE,Africa,Eastern Africa,16529904,72.3,0.515640,59.200,10.314330,7.734280,1587.723183,Zimbabwe
115,Namibia,NaN,NAM,Africa,Southern Africa,2533794,28.7,0.640007,65.062,11.657589,6.676000,9769.848507,Namibia

In [52]:
## Si nota come il dataset relativo alla differenza finanziati-ricevuti contenga informazioni per 231 stati
## Il dataset relativo agli stati invece ne contiene solamente 174, per queste nazioni non sarà possibile calcolare il risultato
## Si utilizza una join standard per non passare i valori nulli nella nuova tabella

ratio_population = difference_lend_borrowed.merge(country_stats[['population', 'country_code', 'country_name']], on='country_code')
ratio_population

,country_code,loan_lend,loan_borrowed,difference,population,country_name
0,AE,2.084820e+06,0.0,2.084820e+06,9400145,United Arab Emirates
1,AF,1.615919e+05,1967950.0,-1.806358e+06,35530081,Afghanistan
2,AL,3.604779e+04,4307350.0,-4.271302e+06,2930187,Albania
3,AM,7.832625e+04,22950475.0,-2.287215e+07,2930450,Armenia
4,AO,3.826498e+04,0.0,3.826498e+04,29784193,Angola
...,...,...,...,...,...,...
165,XK,1.611421e+04,3083025.0,-3.066911e+06,1895250,Kosovo
166,YE,4.373333e+04,3444000.0,-3.400267e+06,28250420,Yemen
167,ZA,9.026885e+05,1006525.0,-1.038365e+05,56717156,South Africa
168,ZM,5.131859e+04,1978975.0,-1.927656e+06,17094130,Zambia
169,ZW,1.685993e+04,5851875.0,-5.835015e+06,16529904,Zimbabwe

In [53]:
## Si calcola il rapporto richiesto e si ordinano i risultati in ordine decrescente
## La norvegia risulta avere il miglior rapporto tra finanziamenti effettuati e finanziamenti ricevuti, Samoa il peggiore

ratio_population['ratio_difference_population'] = ratio_population.difference / ratio_population.population
ratio_population.sort_values(by='ratio_difference_population', ascending=False, inplace=True)
ratio_population

,country_code,loan_lend,loan_borrowed,difference,population,country_name,ratio_difference_population
114,NO,2.144369e+07,0.0,2.144369e+07,5305383,Norway,4.041874
24,CA,9.326728e+07,50000.0,9.321728e+07,36624199,Canada,2.545237
7,AU,5.976490e+07,0.0,5.976490e+07,24450561,Australia,2.444316
159,US,7.258761e+08,46352000.0,6.795241e+08,324459463,United States,2.094327
72,IS,7.006595e+05,0.0,7.006595e+05,335025,Iceland,2.091365
...,...,...,...,...,...,...,...
101,MN,8.104175e+04,15348375.0,-1.526733e+07,3075647,Mongolia,-4.963942
145,SV,5.725099e+04,41691550.0,-4.163430e+07,6377853,El Salvador,-6.527949
3,AM,7.832625e+04,22950475.0,-2.287215e+07,2930450,Armenia,-7.804995
127,PY,5.507944e+04,53964700.0,-5.390962e+07,6811297,Paraguay,-7.914736
164,WS,1.498167e+03,12212175.0,-1.221068e+07,196440,Samoa,-62.159829

In [54]:
## Dump del dataset contenente il rapporto tra la differenza calcolata in precedenza e la popolazione
## Permette di visionare per intero i valori restituiti

#ratio_population.to_csv(path + 'ratio_population.csv', index=False)

### 11) Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

In [55]:
## Si utilizzano gli stessi dataframe utilizzati in precedenza, con l'aggiunta del valore che indica la povertà
## Si rimuovono gli attributi non più utili

#ratio_population = pd.read_csv(path + 'ratio_population.csv')
ratio_population.drop(['ratio_difference_population'], axis=1, inplace=True)
ratio_population

,country_code,loan_lend,loan_borrowed,difference,population,country_name
114,NO,2.144369e+07,0.0,2.144369e+07,5305383,Norway
24,CA,9.326728e+07,50000.0,9.321728e+07,36624199,Canada
7,AU,5.976490e+07,0.0,5.976490e+07,24450561,Australia
159,US,7.258761e+08,46352000.0,6.795241e+08,324459463,United States
72,IS,7.006595e+05,0.0,7.006595e+05,335025,Iceland
...,...,...,...,...,...,...
101,MN,8.104175e+04,15348375.0,-1.526733e+07,3075647,Mongolia
145,SV,5.725099e+04,41691550.0,-4.163430e+07,6377853,El Salvador
3,AM,7.832625e+04,22950475.0,-2.287215e+07,2930450,Armenia
127,PY,5.507944e+04,53964700.0,-5.390962e+07,6811297,Paraguay
164,WS,1.498167e+03,12212175.0,-1.221068e+07,196440,Samoa

In [56]:
## L'attributo population_below_poverty_line è descritto da 174 record di cui 22 sono valori nulli
## Questi vanno combinati ai valori della tabella prodotta in precedenza per la popolazione (169 record disponibili)
## La popolazione sotto la linea di povertà è indicata in percentuale
## Si vuole risalire al numero intero di individui sopra la soglia di povertà
## POPOLAZIONE * (1 - POPOLAZIONE SOTTO LINEA/100)

ratio_population = ratio_population.merge(country_stats[['country_code', 'population_below_poverty_line']], on='country_code')
ratio_population.dropna(subset=['population_below_poverty_line'], axis=0, inplace=True)
ratio_population

,country_code,loan_lend,loan_borrowed,difference,population,country_name,population_below_poverty_line
1,CA,9.326728e+07,50000.0,9.321728e+07,36624199,Canada,9.4
3,US,7.258761e+08,46352000.0,6.795241e+08,324459463,United States,15.1
5,SE,1.645484e+07,0.0,1.645484e+07,9910701,Sweden,15.0
6,NL,2.780164e+07,0.0,2.780164e+07,17035938,Netherlands,8.8
8,CH,1.119486e+07,0.0,1.119486e+07,8476005,Switzerland,6.6
...,...,...,...,...,...,...,...
164,NI,5.228170e+04,30153225.0,-3.010094e+07,6217581,Nicaragua,29.6
165,MN,8.104175e+04,15348375.0,-1.526733e+07,3075647,Mongolia,21.6
166,SV,5.725099e+04,41691550.0,-4.163430e+07,6377853,El Salvador,34.9
167,AM,7.832625e+04,22950475.0,-2.287215e+07,2930450,Armenia,32.0
168,PY,5.507944e+04,53964700.0,-5.390962e+07,6811297,Paraguay,22.2

In [57]:
ratio_population['population_over_poverty_line_int'] = ratio_population.population * (1 - ratio_population.population_below_poverty_line / 100)
ratio_population.population_over_poverty_line_int = ratio_population.population_over_poverty_line_int.astype(int)
ratio_population

,country_code,loan_lend,loan_borrowed,difference,population,country_name,population_below_poverty_line,population_over_poverty_line_int
1,CA,9.326728e+07,50000.0,9.321728e+07,36624199,Canada,9.4,33181524
3,US,7.258761e+08,46352000.0,6.795241e+08,324459463,United States,15.1,275466084
5,SE,1.645484e+07,0.0,1.645484e+07,9910701,Sweden,15.0,8424095
6,NL,2.780164e+07,0.0,2.780164e+07,17035938,Netherlands,8.8,15536775
8,CH,1.119486e+07,0.0,1.119486e+07,8476005,Switzerland,6.6,7916588
...,...,...,...,...,...,...,...,...
164,NI,5.228170e+04,30153225.0,-3.010094e+07,6217581,Nicaragua,29.6,4377177
165,MN,8.104175e+04,15348375.0,-1.526733e+07,3075647,Mongolia,21.6,2411307
166,SV,5.725099e+04,41691550.0,-4.163430e+07,6377853,El Salvador,34.9,4151982
167,AM,7.832625e+04,22950475.0,-2.287215e+07,2930450,Armenia,32.0,1992705
168,PY,5.507944e+04,53964700.0,-5.390962e+07,6811297,Paraguay,22.2,5299189

In [58]:
## Creazione del rapporto richiesto
## Secondo i dati i nostro possesso, lo stato con tale rapporto maggiore è il canada, il peggiore è l'armenia

ratio_population['ratio_difference_non_poverty'] = ratio_population.difference / ratio_population.population_over_poverty_line_int
ratio_population.sort_values(by='ratio_difference_non_poverty', ascending=False, inplace=True)
ratio_population

,country_code,loan_lend,loan_borrowed,difference,population,country_name,population_below_poverty_line,population_over_poverty_line_int,ratio_difference_non_poverty
1,CA,9.326728e+07,50000.0,9.321728e+07,36624199,Canada,9.4,33181524,2.809313
3,US,7.258761e+08,46352000.0,6.795241e+08,324459463,United States,15.1,275466084,2.466816
5,SE,1.645484e+07,0.0,1.645484e+07,9910701,Sweden,15.0,8424095,1.953307
6,NL,2.780164e+07,0.0,2.780164e+07,17035938,Netherlands,8.8,15536775,1.789409
8,CH,1.119486e+07,0.0,1.119486e+07,8476005,Switzerland,6.6,7916588,1.414102
...,...,...,...,...,...,...,...,...,...
160,BO,3.470373e+04,44226725.0,-4.419202e+07,11051600,Bolivia,38.6,6785682,-6.512539
164,NI,5.228170e+04,30153225.0,-3.010094e+07,6217581,Nicaragua,29.6,4377177,-6.876794
166,SV,5.725099e+04,41691550.0,-4.163430e+07,6377853,El Salvador,34.9,4151982,-10.027572
168,PY,5.507944e+04,53964700.0,-5.390962e+07,6811297,Paraguay,22.2,5299189,-10.173183
167,AM,7.832625e+04,22950475.0,-2.287215e+07,2930450,Armenia,32.0,1992705,-11.477940

In [59]:
## Dump del dataset contenente il rapporto tra la differenza calcolata al punto 9 e la popolazione sopra la soglia di povertà
## Permette di visionare per intero i valori restituiti

#ratio_poverty.to_csv(path + 'ratio_poverty.csv', index=False)

### 12) For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.

In [74]:
## Per iniziare è necessario selezionare solamente i dati dalla tabella loans
## Si prelevano solo gli attributi utili per prevenire problemi di computazione

money_per_year = loans[['loan_id', 'loan_amount', 'disburse_time', 'planned_expiration_time', 'duration']]
money_per_year.head()

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration
0,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0
1,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0
2,658010,400.0,2014-01-09 08:00:00+00:00,2014-02-15 21:10:05+00:00,37.0
3,659347,625.0,2014-01-17 08:00:00+00:00,2014-02-21 03:10:02+00:00,34.0
4,656933,425.0,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,57.0

In [75]:
money_per_year.planned_expiration_time = pd.to_datetime(money_per_year.planned_expiration_time)
money_per_year.disburse_time = pd.to_datetime(money_per_year.disburse_time)

C:\Users\matal\anaconda3\lib\site-packages\pandas\core\generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [76]:
## Si creano una serie di dataframe derivati da loans_year
## Disburse time > Planned expiration time

disburse = money_per_year[money_per_year.planned_expiration_time < money_per_year.disburse_time]
disburse['year'] = disburse['disburse_time'].dt.year
disburse['amount'] = disburse['loan_amount']
disburse.head()

<ipython-input-76-7ea51b832ab2>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  disburse['year'] = disburse['disburse_time'].dt.year
<ipython-input-76-7ea51b832ab2>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  disburse['amount'] = disburse['loan_amount']

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year,amount
63,1158981,250.0,2016-11-30 08:00:00+00:00,2016-10-31 05:40:03+00:00,-31.0,2016,250.0
96,961161,200.0,2015-12-07 08:00:00+00:00,2015-11-12 14:30:11+00:00,-25.0,2015,200.0
177,961701,100.0,2015-12-07 08:00:00+00:00,2015-11-13 05:00:03+00:00,-25.0,2015,100.0
207,1155776,200.0,2016-11-30 08:00:00+00:00,2016-10-28 14:30:08+00:00,-33.0,2016,200.0
217,1158968,125.0,2016-11-30 08:00:00+00:00,2016-10-31 01:40:03+00:00,-31.0,2016,125.0

In [77]:
## Anno disburse time = Anno planned expiration time

equal = money_per_year[money_per_year.planned_expiration_time.dt.year == money_per_year.disburse_time.dt.year]
equal['year'] = equal['planned_expiration_time'].dt.year
equal['amount'] = equal['loan_amount']
equal.head()

<ipython-input-77-152df9a93f4e>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  equal['year'] = equal['planned_expiration_time'].dt.year
<ipython-input-77-152df9a93f4e>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  equal['amount'] = equal['loan_amount']

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year,amount
2,658010,400.0,2014-01-09 08:00:00+00:00,2014-02-15 21:10:05+00:00,37.0,2014,400.0
3,659347,625.0,2014-01-17 08:00:00+00:00,2014-02-21 03:10:02+00:00,34.0,2014,625.0
5,659605,350.0,2014-01-15 08:00:00+00:00,2014-02-20 02:30:07+00:00,35.0,2014,350.0
6,660240,125.0,2014-01-20 08:00:00+00:00,2014-02-21 07:50:11+00:00,31.0,2014,125.0
7,661601,1600.0,2014-01-10 08:00:00+00:00,2014-02-25 09:50:03+00:00,46.0,2014,1600.0

In [78]:
## Disburse time < Planned expiration time

planned = money_per_year[money_per_year.planned_expiration_time.dt.year > money_per_year.disburse_time.dt.year]
planned['year_nums'] = (planned['planned_expiration_time'].dt.year - planned['disburse_time'].dt.year) + 1
planned.head()

<ipython-input-78-1438411f8b43>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  planned['year_nums'] = (planned['planned_expiration_time'].dt.year - planned['disburse_time'].dt.year) + 1

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year_nums
0,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2
1,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2
4,656933,425.0,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,57.0,2
12,660363,1175.0,2013-12-23 08:00:00+00:00,2014-02-21 17:10:02+00:00,60.0,2
13,661165,300.0,2013-12-26 08:00:00+00:00,2014-03-26 22:24:34+00:00,90.0,2

In [79]:
## Lavorando sul dataset in cui disburse time < planned expiration time si distinguono
## Gli anni di inizio (disburse time) e di fine (planned expiration time)
## Se ne stila un elenco per duplicare le righe in base all'anno

planned['start'] = planned['disburse_time'].dt.year
planned['finish'] = planned['planned_expiration_time'].dt.year
planned.head()

<ipython-input-79-2b3424c58066>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  planned['start'] = planned['disburse_time'].dt.year
<ipython-input-79-2b3424c58066>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  planned['finish'] = planned['planned_expiration_time'].dt.year

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year_nums,start,finish
0,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2,2013,2014
1,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2,2013,2014
4,656933,425.0,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,57.0,2,2013,2014
12,660363,1175.0,2013-12-23 08:00:00+00:00,2014-02-21 17:10:02+00:00,60.0,2,2013,2014
13,661165,300.0,2013-12-26 08:00:00+00:00,2014-03-26 22:24:34+00:00,90.0,2,2013,2014

In [80]:
planned['years_list'] = planned.apply(lambda x: list(range(x.start, x.finish + 1)), axis=1)
planned = planned.explode('years_list')
planned = planned.reset_index(drop=True)
planned.head()

<ipython-input-80-953c4948ad23>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  planned['years_list'] = planned.apply(lambda x: list(range(x.start, x.finish + 1)), axis=1)

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year_nums,start,finish,years_list
0,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2,2013,2014,2013
1,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2,2013,2014,2014
2,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2,2013,2014,2013
3,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2,2013,2014,2014
4,656933,425.0,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,57.0,2,2013,2014,2013

In [81]:
## È ora possibile calcolare l'importo dovuto giornaliero

planned['amount_per_day'] = planned['loan_amount'] / planned['duration']
planned.head()

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year_nums,start,finish,years_list,amount_per_day
0,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2,2013,2014,2013,2.358491
1,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2,2013,2014,2014,2.358491
2,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2,2013,2014,2013,4.166667
3,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2,2013,2014,2014,4.166667
4,656933,425.0,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,57.0,2,2013,2014,2013,7.456140

In [82]:
## Per calcolare l'importo per ciascun anno è necessario distinguere tra l'anno in cui il finanzialmento è iniziato,
## Eventuali anni in cui il finanziamento ha occupato tutti i giorni ed anni in cui il finanziamento è terminato
## Inoltre si aggiunge la distinzione tra anni bisestili e non

def calc_amount_per_year(data):
    if data.years_list / 4 == 0 and data.years_list / 100 == 0 and data.years_list / 400 == 0:
        durata_anno = 366
    else:
        durata_anno = 365
        
    ## Primo anno della lista, inizio prestito
    if data.years_list == data.start:
        payday = durata_anno - data.disburse_time.timetuple().tm_yday
        return data.amount_per_day * payday
    ## Ultimo anno della lista, fine prestito
    elif data.years_list == data.finish:
        payday = data.planned_expiration_time.timetuple().tm_yday - 1
        return data.amount_per_day * payday
    ## Anno nel mezzo della lista, considero tutti i giorni per il pagamento
    else:
        return durata_anno * data.amount_per_day

In [83]:
## Calcolo dell'importo dovuto per anno

planned['amount'] = planned.apply(lambda x: calc_amount_per_year(x), axis=1)
planned.drop(columns=['year_nums', 'start', 'finish', 'amount_per_day'], inplace=True)
planned.rename(columns={'years_list': 'year'}, inplace=True)
planned.head()

,loan_id,loan_amount,disburse_time,planned_expiration_time,duration,year,amount
0,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2013,21.226415
1,657307,125.0,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,53.0,2014,103.773585
2,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2013,45.833333
3,657259,400.0,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,96.0,2014,350.000000
4,656933,425.0,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,57.0,2013,104.385965

In [84]:
## Riunificazione dei dataframe disburse, equal e planned

money_per_year = pd.concat([disburse, equal, planned], axis=0).reset_index(drop=True)
money_per_year = money_per_year.groupby('year').sum().reset_index()
money_per_year

   year       loan_id  loan_amount    duration        amount
0  2011     837142491    2667000.0    178757.0  6.316783e+05
1  2012   60705538108  121858325.0   7381896.0  1.132067e+08
2  2013   91947916252  148353550.0   9011597.0  1.262491e+08
3  2014  153640055838  187175425.0  11952344.0  1.553850e+08
4  2015  199063018684  189773550.0  11428091.0  1.640900e+08
5  2016  246030282845  186152800.0  11482680.0  1.634674e+08
6  2017  324917869563  194955550.0  12289821.0  1.786562e+08
7  2018   27495058364   15665200.0    829259.0  6.325923e+06

In [85]:
## Dump del dataset money_per_year, permette di visionare per intero i valori restituiti
## Contiene i dati raccolti per anno relativi ai finanziamenti (con granularità giornaliera)

#money_per_year.to_csv(path + 'money_per_year.csv', index=False)